; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	spectrograph0 - mode
	thermograph1 - mode
	Star0 - direction
	GroundStation1 - direction
	Star3 - direction
	GroundStation4 - direction
	GroundStation2 - direction
	Star5 - direction
	Planet6 - direction
	Phenomenon7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Star11 - direction
	Star12 - direction
	Phenomenon13 - direction
	Planet14 - direction
	Phenomenon15 - direction
)
(:init
	(supports instrument0 thermograph1)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 thermograph1)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 Star5)
	(supports instrument2 spectrograph0)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 Star5)
	(calibration_target instrument2 GroundStation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation2)
)
(:goal (and
	(have_image Planet6 spectrograph0)
	(have_image Phenomenon7 spectrograph0)
	(have_image Star8 spectrograph0)
	(have_image Phenomenon9 spectrograph0)
	(have_image Planet10 thermograph1)
	(have_image Star11 thermograph1)
	(have_image Star12 spectrograph0)
	(have_image Phenomenon13 thermograph1)
	(have_image Planet14 thermograph1)
	(have_image Phenomenon15 spectrograph0)
))

)

; plan
1. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 0 of 10
2. (calibrate satellite0 instrument2 groundstation2)
   added: (calibrated instrument2)
   goals met: 0 of 10
3. (turn_to satellite0 phenomenon7 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 phenomenon7)
   goals met: 0 of 10
4. (take_image satellite0 phenomenon7 instrument2 spectrograph0)
   added: (have_image phenomenon7 spectrograph0)
   goals met: 1 of 10
5. (turn_to satellite0 phenomenon15 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 phenomenon15)
   goals met: 1 of 10
6. (take_image satellite0 phenomenon15 instrument2 spectrograph0)
   added: (have_image phenomenon15 spectrograph0)
   goals met: 2 of 10
7. (turn_to satellite0 phenomenon13 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 phenomenon13)
   goals met: 2 of 10
8. (take_image satellite0 phenomenon13 instrument2 thermograph1)
   added: (have_image phenomenon13 thermograph1)
   goals met: 3 of 10
9. (turn_to satellite0 phenomenon9 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 phenomenon9)
   goals met: 3 of 10
10. (take_image satellite0 phenomenon9 instrument2 spectrograph0)
   added: (have_image phenomenon9 spectrograph0)
   goals met: 4 of 10
11. (turn_to satellite0 planet10 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 planet10)
   goals met: 4 of 10
12. (take_image satellite0 planet10 instrument2 thermograph1)
   added: (have_image planet10 thermograph1)
   goals met: 5 of 10
13. (turn_to satellite0 planet14 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 planet14)
   goals met: 5 of 10
14. (take_image satellite0 planet14 instrument2 thermograph1)
   added: (have_image planet14 thermograph1)
   goals met: 6 of 10
15. (turn_to satellite0 planet6 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 planet6)
   goals met: 6 of 10
16. (take_image satellite0 planet6 instrument2 spectrograph0)
   added: (have_image planet6 spectrograph0)
   goals met: 7 of 10
17. (turn_to satellite0 star11 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 star11)
   goals met: 7 of 10
18. (take_image satellite0 star11 instrument2 thermograph1)
   added: (have_image star11 thermograph1)
   goals met: 8 of 10
19. (turn_to satellite0 star12 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star12)
   goals met: 8 of 10
20. (take_image satellite0 star12 instrument2 spectrograph0)
   added: (have_image star12 spectrograph0)
   goals met: 9 of 10
21. (turn_to satellite0 star8 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star8)
   goals met: 9 of 10
22. (take_image satellite0 star8 instrument2 spectrograph0)
   added: (have_image star8 spectrograph0)
   goals met: 10 of 10
